{
    "tasks":[
        {
            "id":0,
            "title": "Get Started!"
        },
        {   
            "id":1,
            "title": "1:What is the current data value of California?"
        },
        {
            "id":2,
            "title": "2:What is the current data value of New York?"
        },
        {
            "id":3,
            "title": "3:What is the current data value of Texas?"
        },
        {
            "id":4,
            "title": "4:What is the average data value around California?"
        },
        {
            "id":5,
            "title": "5:What is the average data value around Florida?"
        },
        {
            "id":6,
            "title": "6:What is the average data value around North Carolina?"
        },
        {
            "id":7,
            "title": "7:Which state has the highest case?"
        },
        {
            "id":8,
            "title": "8:Which state has the highest case?"
        },
        {
            "id":9,
            "title": "9:Which state has the highest case?"
        },
        {
            "id":10,
            "title": "10:Sort the cases around California"
        },
        {
            "id":11,
            "title": "11:Sort the cases around Texas"
        },
        {
            "id":12,
            "title": "12:Sort the cases around North Carolina"
        },
        {
            "id":13,
            "title": "13:What is the data range from all the states?"
        },
        {
            "id":14,
            "title": "14:What is the data range from all the states?"
        },
        {
            "id":15,
            "title": "15:What is the data range from all the states?"
        },
        {
            "id":16,
            "title": "16:What is the data distribution from all the states?"
        },
        {
            "id":17,
            "title": "17:What is the data distribution from all the states?"
        },
        {
            "id":18,
            "title": "18:What is the data distribution from all the states?"
        },
        {
            "id":19,
            "title": "19:Find anormalies that are different in a local region"
        },
        {
            "id":20,
            "title": "20:Find anormalies that are different in a local region"
        },
        {
            "id":21,
            "title": "21:Find anormalies that are different in a local region"
        },
        {
            "id":22,
            "title": "22:Clustering the states based on the data values"
        },
        {
            "id":23,
            "title": "23:Clustering the states based on the data values"
        },
        {
            "id":24,
            "title": "24:Clustering the states based on the data values"
        },
        {
            "id":25,
            "title": "25:Is there a similarity between the states around Arizona and the states around Maine?"
        },
        {
            "id":26,
            "title": "26:Is there a similarity between the states around Utah and the states around New York?"
        },
        {
            "id":27,
            "title": "27:Is there a similarity between the states around Washington and the states around North Carolina?"
        },
        {
            "id":28,
            "title": "28:Find something you are interested in or find something new"
        },
        {
            "id":29,
            "title": "29:Find something you are interested in or find something new"
        },
        {
            "id":30,
            "title": "30:Find something you are interested in or find something new"
        },
        {
            "id":31,
            "title": "31:Summarize the confirmed, the death and the recovered trends of Florida"
        },
        {
            "id":32,
            "title": "32:Summarize the confirmed, the death and the recovered trends of Virginia"
        },
        {
            "id":33,
            "title": "33:Summarize the confirmed, the death and the recovered trends of Massachusetts"
        },
        {
            "id":34,
            "title": "34:What is the average confirmed case number in the time interval?"
        },
        {
            "id":35,
            "title": "35:What is the average confirmed case number in the time interval?"
        },
        {
            "id":36,
            "title": "36:What is the average confirmed case number in the time interval?"
        },
        {
            "id":37,
            "title": "37:Which timestamp does the confimed case of Florida increase the most?"
        },
        {
            "id":38,
            "title": "35:Which timestamp does the confirmed case increase the most?"
        },
        {
            "id":39,
            "title": "39:Which timestamp does the recovered case increase the most?"
        },
        {
            "id":40,
            "title": "40:Rank the top three timestamps that the confirmed case inceasing the most."
        },
        {
            "id":41,
            "title": "41:Rank the top three timestamps that the confirmed case inceasing the most."
        },
        {
            "id":42,
            "title": "42:Rank the top three timestamps that the recovered case inceasing the most."
        },
        {
            "id":43,
            "title": "43:What is the range of the confirmed case numbers during the second half of the duration?"
        },
        {
            "id":44,
            "title": "44:What is the range of the confirmed case numbers during the second half of the duration?"
        },
        {
            "id":45,
            "title": "45:What is the range of the recovered case numbers during the second half of the duration?"
        },
        {
            "id":46,
            "title": "46:Describe data distribution of the confirmed case"
        },
        {
            "id":47,
            "title": "47:Describe data distribution of the confirmed case"
        },
        {
            "id":48,
            "title": "48:Describe data distribution of the confirmed case"
        },
        {
            "id":49,
            "title": "49:Are there any abnomal durations for confirmed cases of Washington (any rapid increase or sudden drop)?"
        },
        {
            "id":50,
            "title": "50:Are there any abnomal durations for confirmed cases of New York (any rapid increase or sudden drop)?"
        },
        {
            "id":51,
            "title": "51:Are there any abnomal durations for confirmed cases of Florida (any rapid increase or sudden drop)?"
        },
        {
            "id":52,
            "title": "52:Divide the timeinterval into different segments based on the confirmed cases of California."
        },
        {
            "id":53,
            "title": "53:Divide the timeinterval into different segments based on the confirmed cases of Texas."
        },
        {
            "id":54,
            "title": "54:Divide the timeinterval into different segments based on the confirmed cases of North Carolina."
        },
        {
            "id":55,
            "title": "55:Does the confirmed case of Texas increase with the confirmed case of Arizona?"
        },
        {
            "id":56,
            "title": "56:Does the confirmed case of Massachusetts increase with the confirmed case of New Jersey??"
        },
        {
            "id":57,
            "title": "57:Does the recovered case of North Carolina increase with the confirmed case of Florida?"
        },
        {
            "id":58,
            "title": "58:Find something interesting from the timeline or explore a time interval you have not checked so far"
        },
        {
            "id":59,
            "title": "59:Find something interesting from the timeline or explore a time interval you have not checked so far"
        },
        {
            "id":60,
            "title": "60:Find something interesting from the timeline or explore a time interval you have not checked so far"
        },
        {
            "id":61,
            "title": "61:Select different attributes"
        },
        {
            "id":62,
            "title": "62:Select different attributes"
        },
        {
            "id":63,
            "title": "63:Select different attributes"
        },
        {
            "id":64,
            "title": "64:Select a state"
        },
        {
            "id":65,
            "title": "65:Select a state"
        },
        {
            "id":66,
            "title": "66:Select a state"
        },
        {
            "id":67,
            "title": "67:Switch a different time stamp"
        },
        {
            "id":68,
            "title": "68:Switch a different time stamp"
        },
        {
            "id":69,
            "title": "69:Switch a different time stamp"
        },
        {
            "id":70,
            "title": "70:Summarize average value of states in the west coast in the second half time interval"
        },
        {
            "id":71,
            "title": "71:Summarize average value of states in the east coast in the second half time interval"
        },
        {
            "id":72,
            "title": "72:Summarize average value of states in the middle west in the second half time interval"
        },
        {
            "id":73,
            "title": "73:Find the maximum value of states in the west coast in the second half time interval"
        },
        {
            "id":74,
            "title": "74:Find the maximum value of states in the east coast in the second half time interval"
        },
        {
            "id":75,
            "title": "75:Find the maximum value of states in the middle west in the second half time interval"
        },
        {
            "id":76,
            "title": "76:Sort states in the west coast within the first half time interval based on average value?"
        },
        {
            "id":77,
            "title": "77:Sort states in the east coast within the first half time interval based on increasing rate?"
        },
        {
            "id":78,
            "title": "78:Sort states in the west coast within the first half time interval based on increasing rate?"
        },
        {
            "id":79,
            "title": "79:What is the data range between the average confirmed case number in the west coast at the middle of time interval?"
        },
        {
            "id":80,
            "title": "80:What is the data range between the average confirmed case number in the east coast at the middle of time interval?"
        },
        {
            "id":81,
            "title": "81:What is the data range between the average confirmed case number in the south at the middle of time interval?"
        },
        {
            "id":82,
            "title": "82:Describe the distribution of confirmed cases among west coast in the middle time stamp?"
        },
        {
            "id":83,
            "title": "83:Describe the distribution of confirmed cases among middle west in the middle time stamp?"
        },
        {
            "id":84,
            "title": "84:Describe the distribution of confirmed cases among southern states in the middle time stamp?"
        },
        {
            "id":85,
            "title": "85:Are there outliers in the middle west in the second half time interval?"
        },
        {
            "id":86,
            "title": "86:Are there outliers in the west coast in the second half time interval?"
        },
        {
            "id":87,
            "title": "87:Are there outliers in the south in the second half time interval?"
        },
        {
            "id":88,
            "title": "88:Are there other states similar to data trends in North Carolina?"
        },
        {
            "id":89,
            "title": "89:Are there other states similar to data trends in Texas?"
        },
        {
            "id":90,
            "title": "90:Are there other states similar to data trends in Missouri?"
        },
        {
            "id":91,
            "title": "91:Is there a correlation between data of north states and south states?"
        },
        {
            "id":92,
            "title": "92:Is there a correlation between data of east states and west states?"
        },
        {
            "id":93,
            "title": "93:Is there a correlation between data of eastsouth states and northwest states?"
        },
        {
            "id":94,
            "title": "94:Find something you are interested in or find something new with both visualizations"
        },
        {
            "id":95,
            "title": "95:Find something you are interested in or find something new with both visualizations"
        },
        {
            "id":96,
            "title": "96:Find something you are interested in or find something new with both visualizations"
        },
        {
            "id":97,
            "title": "97:Explore the whole data, find 10 insights related to the handling of pandemic. At the end, draw a conclusion how to better handle such situations based on your findings."
        },
        {
            "id":999,
            "title": "End of the tasks"
        }
    ]
}